{
    "https://www.statefarmcenter.com/events/detail/avatar": {
        "title": "Avatar: The Last Airbender in Concert",
        "description": "Celebrate 20 years of Avatar: The Last Airbender with this unforgettable concert experience. \nThe 20th Anniversary Tour of Avatar: The Last Airbender In Concert combines a breathtaking live orchestral performance with a two-hour visual journey through fan-favorite moments from the animated series, all shown on a full-size cinema screen.   This special edition also features new surprises, inviting fans to experience the story in a new light, with creative touches made just for this performance. Original dialogue and sound effects remain intact, while Emmy® Award-winning composer Jeremy Zuckerman’s score is performed live, perfectly synchronized with the visuals. \nFrom taiko and erhu to strings and clarinets, the orchestra brings every moment to life, immersing you in the elemental world of Aang, Katara, Toph, Zuko, and the rest of Team Avatar. \nWhether you're rediscovering the series or celebrating it anew, this is the way to experience its legacy on the big screen.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Oct 14, 2025",
        "end_date": "Oct 14, 2025",
        "start_time": "7:00 PM",
        "end_time": "10:00 PM",
        "cost": "$25-$89 plus fees"
    },
    "https://www.statefarmcenter.com/events/detail/sofia": {
        "title": "Sofia Isella",
        "description": "",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Oct 15, 2025",
        "end_date": "Oct 15, 2025",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "UIUC Student - $17; Public - $22; Early Access - $5 Add-On"
    },
    "https://www.statefarmcenter.com/events/detail/tt-tft": {
        "title": "The Temptations & The Four Tops",
        "description": "THE TEMPTATIONS: The Temptations, often referred to as American music royalty, are world-renowned superstars of entertainment, revered for their phenomenal catalog of music and prolific career. They are one of the most iconic, bestselling brands in the entertainment world today. While the group has evolved over the years, Dr. Otis Williams has continued to lead the group and carry the torch forward for the next generation of Temptations’ fans. The Temptations are headlining concerts around the country throughout 2025. Their concerts include fan favorites such as “My Girl,” “Just My Imagination (Running Away with Me),” “Ain’t Too Proud to Beg,” “Papa Was a Rollin’ Stone,” and more.  Ranked #1 in Billboard magazine’s most recent list of the “Greatest R&B/Hip-Hop Artists of All Time,” The Temptations also appear in the magazine’s 125th Anniversary list of the “125 Greatest of All Time Artists.” In addition, Rolling Stone magazine named the group among the “100 Greatest Artists of All Time.” In September of 2020, the editors of Rolling Stone magazine commented that The Temptations are “Indisputably the greatest black vocal group of the Modern Era…,” and listed the group’s Anthology album among the “500 Greatest Albums of All Time.” The Anthology album has appeared in all three of Rolling Stone’s 500 Greatest Albums’ lists.   The Temptations have been the subject of a smash hit Broadway musical, Ain’t Too Proud: The Life and Times of The Temptations, based on Otis Williams’ personal journey, which opened on Broadway at the Imperial Theatre on March 21st, 2019. The musical received 12 Tony nominations, including Best Musical, and won the Tony Award® for Best Choreography at the 73rd Tony Awards at Radio City Music Hall in New York City on June 10, 2019. Now on tour, the Musical is scheduled to open in theaters in more than 50 cities across the U.S. during the next several years. Ain’t Too Proud opened in the UK, in the West End of London, at the Prince Edward Theatre on April 20, 2023. For details, see the link here: https://ainttooproudmusical.com/ The Temptations’ heritage, influence, and contributions to, not only American culture and African American communities but also to the global music landscape are monumental. The Temptations’ presence in the world today has never been more vivid, and their popularity is ever-increasing.    THE FOUR TOPS The quartet, originally called the Four Aims, made their first single for Chess in 1956, and spent seven years on the road and in nightclubs, singing pop, blues, Broadway, but mostly jazz—four-part harmony jazz. When Motown’s Berry Gordy Jr. found out they had hustled a national “Tonight Show” appearance, he signed them without an audition to be the marquee act for the company’s Workshop Jazz label. That proved short-lived, and Stubbs’ powerhouse baritone lead and the exquisite harmonies of Fakir, Benson, and Payton started making one smash after another with the writing-producing trio Holland-Dozier-Holland.   Their first Motown hit, “Baby I Need Your Loving” in 1964, made them stars and their sixties track record on the label is indispensable to any retrospective of the decade. Their songs, soulful and bittersweet, were across-the-board successes. “I Can’t Help Myself (Sugar Pie, Honey Bunch),” a no. 1 R&B and Pop smash in 1965, is one of Motown’s longest-running chart toppers; it was quickly followed by a longtime favorite, “It’s The Same Old Song” (no. 2 R&B/no. 5 pop). Their commercial peak was highlighted by a romantic trilogy: the no. 1 “Reach Out I’ll Be There,” “Standing In The Shadows Of Love” (no. 2 R&B/no. 6 pop) and “Bernadette” (no. 3 R&B/no. 4 pop)—an extraordinary run of instant H-D-H classics. Other Tops hits from the decade included “Ask The Lonely,” “Shake Me, Wake Me (When It’s Over),” “Something About You,” “You Keep Running Away,” “7-Rooms Of Gloom” and their covers of “Walk Away Renee” and “If I Were A Carpenter.” The group was also extraordinarily popular in the U.K.   After H-D-H split from Motown, producer Frank Wilson supervised the R&B Top 10 hits “It’s All In The Game” and “Still Water (Love)” at the start of the seventies. The Tops also teamed with Motown’s top girl group, the Supremes, post-Diana Ross. Billing themselves The Magnificent Seven for a series of albums, they hit with a cover of “River Deep - Mountain High.”   When Motown left Detroit in 1972 to move to Los Angeles, the steadfast Tops decided to stay at home, and with another label. They kept up a string of hits with ABC-Dunhill for the next few years: “Ain’t No Woman (Like The One I’ve Got),” a Top 5 hit; the Top 10 “Keeper Of The Castle”; and the R&B Top 10’s “Are You Man Enough (from the movie Shaft In Africa),” “Sweet Understanding Love,” “One Chain Don’t Make No Prison” (later covered by Santana), “Midnight Flower” and the disco perennial “Catfish.”   In 1980 the group moved to Casablanca Records. The following year they were at no. 1 again, with “When She Was My Girl,” making them one of the few groups to have hits in three consecutive decades. They also scored R&B Top 40s with the ballads “Tonight I’m Gonna Love You All Over” and “I Believe In You And Me,” the original version of the 1996 Whitney Houston smash. And the Tops were heard in the film Grease 2 with “Back To School Again.” By 1983, riding the wave of the company’s 25th anniversary celebration, the Tops were back with Motown and H-D-H. The reunion resulted in the R&B Top 40 hits “I Just Can’t Walk Away” and “Sexy Ways.”   They signed with Arista later in the decade, and there they racked up their final solo Top 40 hit, “Indestructible,” which was the theme of the 1988 Summer Olympics. That year they also partnered with Aretha Franklin, a longtime friend from Detroit, for the Top 40 R&B “If Ever A Love There Was.” During this period, Stubbs stepped out and gained notoriety for voicing the man-eating plant Audrey II in the film musical Little Shop Of Horrors, for which he sang the cult classic “Mean Green Mother From Outer Space.”   In 1990, with 24 Top 40 pop hits to their credit, the Four Tops were inducted into the Rock & Roll Hall Of Fame. Though they would no longer have hits on record, the group continued to be a hit in concert, touring incessantly, a towering testament to the enduring legacy of the Motown Sound they helped shape and define. Following Payton’s death in 1997, the group briefly worked as a trio until Theo Peoples, a former Temptation, was recruited to restore the group to a quartet. When Stubbs subsequently grew ill, Peoples became the lead singer and former Motown artist-producer Ronnie McNeir was enlisted to fill Payton’s spot. In 2005, when Benson died, Payton’s son Roquel replaced him.   For Rolling Stone’s 2004 article “The Immortals – The Greatest Artists Of All Time,” Smokey Robinson remembered: “They were the best in my neighborhood in Detroit when I was growing up (and) the Four Tops will always be one of the biggest and the best groups ever. Their music is forever.\"",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Oct 16, 2025",
        "end_date": "Oct 16, 2025",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$39-$99 + Fees"
    },
    "https://www.statefarmcenter.com/events/detail/tina": {
        "title": "TINA - The Tina Turner Musical",
        "description": "TINA – The Tina Turner Musical is the triumphant story of the Queen of Rock and Roll set to the pulse-pounding soundtrack of her most beloved hits! TINA presents Tina’s journey against all odds to become one of the world’s most beloved artists of all time. Featuring her much loved songs, TINA is written by Pulitzer Prize-winning playwright Katori Hall.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Oct 21, 2025",
        "end_date": "Oct 21, 2025",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$39-$99"
    },
    "https://www.statefarmcenter.com/events/detail/globetrotters100": {
        "title": "Harlem Globetrotters 100 Year Tour",
        "description": "THE HARLEM GLOBETROTTERS 100 YEAR TOUR 100 Years of Thrills. 100 Years of Laughs. 100 Years of Joy. This is a once-in-a-century celebration of 100 Years of Jaw-Dropping “No Way!” moves, 100 Years of “Wow!” and 100 Years Heart-Pounding Thrills! The Harlem Globetrotters are coming to your city with their most LEGENDARY TOUR EVER. From gravity-defying dunks to game-changing tricks, experience the team that redefined basketball! This is history you can feel and a celebration of 100 years of over-the-top FUN with all-new surprises like the Golden Basketball by Spalding. This is a fan celebration from the moment you arrive with epic new pre-game magic, unforgettable post-game interactions, and the most fan-fueled experience in sports. This is your only chance to be part of The Harlem Globetrotters 100 Year Tour. Don’t miss your chance to be a part of the LEGACY.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Jan  9, 2026",
        "end_date": "Jan  9, 2026",
        "start_time": "7:00 PM",
        "end_time": "10:00 PM",
        "cost": "$42-$120.50"
    },
    "https://www.statefarmcenter.com/events/detail/kinkyboots-1": {
        "title": "Kinky Boots",
        "description": "Broadway’s Tony® and Grammy Award®-winning big-hearted musical hit, Kinky Boots, captivates and entertains audiences around the world with a score by Cyndi Lauper, book by Harvey Fierstein, and original direction and choreography by Jerry Mitchell. Based on true events, Kinky Boots follows the journey of an unlikely pair who discover that you change the world when you change your mind.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Mar 25, 2026",
        "end_date": "Mar 25, 2026",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$39-$99"
    },
    "https://www.statefarmcenter.com/events/detail/musicman": {
        "title": "Meredith Wilson's THE MUSIC MAN",
        "description": "There's trouble in River City when a fast-talking salesman gets his heart stolen by the town librarian. Meredith Willson's six-time, Tony Award-winning musical comedy The Music Man follows fast-talking traveling salesman, Harold Hill, as he cons the people of River City, Iowa, into buying instruments and uniforms for a boys' band that he vows to organize – this, despite the fact that he doesn't know a trombone from a treble clef. His plans to skip town with the cash are foiled when he falls for Marian, the librarian, who transforms him into a respectable citizen by curtain's fall.  Featuring songs such as \"Seventy-Six Trombones,\" \"Trouble,\" \"'Til There Was You,\" \"Pickalittle\" and “Gary, Indiana,\" The Music Man is a family-friendly story to be shared with every generation.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "Mar 30, 2026",
        "end_date": "Mar 30, 2026",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$39-$99"
    },
    "https://www.statefarmcenter.com/events/detail/doubtfire": {
        "title": "Mrs. Doubtfire",
        "description": "Everyone’s favorite Scottish nanny is headed to Champaign in “a feel-good, family-friendly comedy that delivers” (The Hollywood Reporter). Based on the beloved film, it’s “the lovable, big-hearted musical comedy we need right now” (Chicago Tribune) – one that proves we’re better together.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "May  2, 2026",
        "end_date": "May  2, 2026",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$39-$99"
    },
    "https://www.statefarmcenter.com/events/detail/hadestown": {
        "title": "HADESTOWN",
        "description": "COME SEE HOW THE WORLD COULD BE. Welcome to HADESTOWN, where a song can change your fate. Winner of eight 2019 Tony Awards® including Best Musical and the 2020 Grammy® Award for Best Musical Theater Album, HADESTOWN is a haunting and hopeful theatrical experience that grabs you and never lets go.",
        "location": "State Farm Center 1800 S 1st St, Champaign, IL 61820",
        "tag": "Entertainment",
        "host": "State Farm Center",
        "start_date": "May 12, 2026",
        "end_date": "May 12, 2026",
        "start_time": "7:30 PM",
        "end_time": "10:30 PM",
        "cost": "$50-$120"
    }
}