{
    "https://calendars.illinois.edu//detail/7?eventId=33526608": {
        "title": "Sweetbitter: The Literary Legacies and Afterlives of Sappho",
        "description": "The ancient poet Sappho coined “sweetbitter” in one of her most evocative verses, still striking us to the heart nearly three millennia later. But who was Sappho? As with so many ancient figures, she is more legend than person today, her story told and retold even as her poetry continues to enchant and move us. Ranging from ancient Greece to seventeenth century France to twentieth century Britain, this exhibit will explore Sappho as poet, muse, and icon.The exhibit, Sweetbitter: The Literary Legacies and Afterlives of Sappho, will be on display in the RBML through May 2025.",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "The Rare Book & Manuscript Library",
        "location": "Main Library Room 346",
        "start_date": "Sep 19, 2025",
        "end_date": "Aug 10, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/7?eventId=33533914": {
        "title": "Imagination, Faith, and Desire: Art and Agency in European Prints, 1475–1800",
        "description": "With over 100 prints on display—including works by Rembrandt, Goya, and Dürer—Imagination, Faith, and Desire is extraordinary for the significance of the works and the exceptionally high quality of the impressions, the excellence of which rivals the holdings at many major museums. On view September 25, 2025, through February 28, 2026. Curated by Maureen Warren, Curator of European and American Art, with contributions from Yajie Hui, Nancy Karrels, and Sandra Racek. In conjunction with the exhibition, Krannert Art Museum is hosting a daylong symposium: Envisioning Gender and Sexuality in Premodern European Prints (Oct 17). Open Tueday–Friday (10–5), Saturday (10–4), and Thursdays until 8 pm, when school is in session. The museum is free and open to everyone. Parking nearby is free after 5 pm and on weekends. This exhibition is supported by the Ursula and R. Stanley Johnson Charitable Fund; the Sandra L. Batzli Memorial Fund; DutchCultureUSA, a program of the Kingdom of the Netherlands in the United States; and in part by Villa Albertine—The French Institute for Culture and Education/Cultural Services of the French Embassy.Krannert Art Museum acknowledges support from the Illinois Arts Council.           ",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "Krannert Art Museum",
        "location": "Krannert Art Museum, 500 E. Peabody Dr., Champaign",
        "start_date": "Sep 25, 2025",
        "end_date": "Feb 28, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/7?eventId=33533753": {
        "title": "Hygiene & Winter Gear Drive",
        "description": "As the colder months approach, help bring warmth to our campus community by donating new or gently used hygiene products and winter gear. Your contributions will directly assist students in need.We are collecting:Winter gear (new or gently used).Coats and jacketsHats, gloves, and scarvesWarm socksBlanketsHygiene products (new and unopened). Both travel- and full-sized items are helpful.Soap and body washShampoo and conditionerToothpaste and toothbrushesDeodorantFeminine hygiene productsDisposable razorsHand sanitizer and lotionDrop off donation box will be available all week at McKinley Health Center and the Turner Student Services building.",
        "cost": 0.0,
        "tag": "Community Service",
        "host": "Office of the Dean of Students - Basic Needs",
        "location": "McKinley Health Center and Turner Student Services",
        "start_date": "Oct 6, 2025",
        "end_date": "Oct 10, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/7?eventId=33533737": {
        "title": "Lunch Skate",
        "description": "Spend time with your friends on the ice! Free admission for students who have been assessed the student service fee; students must swipe valid iCard. There is a $3 skate rental fee.",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "Campus Recreation",
        "location": "Ice Arena",
        "start_date": "Oct 6, 2025",
        "end_date": "Oct 10, 2025",
        "start_time": "11:15 AM",
        "end_time": "12:45 PM"
    },
    "https://calendars.illinois.edu//detail/7?eventId=33533727": {
        "title": "Open Climb",
        "description": "Join us for an open climb at Campus Recreation! The climbing wall is a 35.5-foot tall, state-of-the-art manufactured structure designed to challenge first-timers or seasoned climbers. Routes are changed regularly to maintain a high level of fun and challenge. You don’t need experience, equipment, or a belayer. The staff will outfit you with the necessary gear for a small fee and provide you with a belay. First timers must fill out waiver on Active Illini. ",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "Campus Recreation",
        "location": "ARC Climbing Wall",
        "start_date": "Oct 6, 2025",
        "end_date": "Oct 10, 2025",
        "start_time": "3:00 PM",
        "end_time": "9:00 PM"
    },
    "https://calendars.illinois.edu//detail/557?eventId=33515537": {
        "title": "Fall break begins",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Ceremony/Service",
        "host": "University of Illinois Board of Trustees",
        "start_date": "Nov 22, 2025",
        "end_date": "Nov 22, 2025",
        "start_time": "8:30 AM",
        "end_time": "8:30 AM"
    },
    "https://calendars.illinois.edu//detail/557?eventId=33515538": {
        "title": "Instruction resumes",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Other",
        "host": "U-C Senate",
        "start_date": "Dec 1, 2025",
        "end_date": "Dec 1, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/557?eventId=33515539": {
        "title": "Last Day of Instruction, Fall Semester",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Other",
        "host": "U-C Senate",
        "start_date": "Dec 10, 2025",
        "end_date": "Dec 10, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/557?eventId=33515540": {
        "title": "Reading Day - IT No Change Period in effect",
        "description": "The Technology Services No Change period is designed to minimize the number of technical disruptions that might occur around final exams.Beginning on Reading Day and continuing a few days past the end of finals, Technology Services tries to make no technical changes to hardware or software that might disrupt the availability of the campus network, data storage, web sites or any of the software-based services that Technology Services provides to campus. Changes or updates will only be made by Technology Services for emergency purposes during the No Change period.",
        "cost": 0.0,
        "tag": "Other",
        "host": "Technology Services",
        "start_date": "Dec 11, 2025",
        "end_date": "Dec 11, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/557?eventId=33515541": {
        "title": "Final Exams Begin",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Ceremony/Service",
        "host": "U-C Senate",
        "start_date": "Dec 12, 2025",
        "end_date": "Dec 12, 2025",
        "start_time": "8:30 AM",
        "end_time": "8:30 AM"
    },
    "https://calendars.illinois.edu//detail/594?eventId=33525631": {
        "title": "Get Fresh! Seasonal Food Program",
        "description": "Get Fresh is a seasonal foods program that aims to increase the availability, accessibility, and consumption of fresh produce on campus. Participants will pick up their re-usable Get Fresh! tote of seasonal fruit and vegetables every Wednesday. Pick up your bag between 3-5pm at the ARC Instructional Kitchen. Participants Receive: • Get Fresh! reusable grocery tote • A sample of a variety of seasonal produce each week • Recipes each week for ideas on how to use your produce  • 1-2 types of bread and/or sweets from Tooth Butter Bakery • Educational resources prepared by McKinley's Health Education Unit and nutrition peers • Produce sample sources by The Student Sustainable Farm. Registration closes 3 days prior to each session. ",
        "cost": "$75-90",
        "tag": "Health/Fitness",
        "host": "Campus Recreation, McKinley Health Education, Sustainable Student Farm, Tooth Butter\n                                 Bakery",
        "location": "ARC Instructional Kitchen",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/594?eventId=33532698": {
        "title": "Flu Shots: College of Law",
        "description": "Never Miss A Memory! Get your free flu shot today. Bring your University of Illinois ID card and please wear attire that provides access to your upper arm.",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "McKinley Health Center",
        "location": "Law Bldg: Mock Court Room",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "9:30 AM",
        "end_time": "1:30 PM"
    },
    "https://calendars.illinois.edu//detail/594?eventId=33532625": {
        "title": "Breast Cancer Awareness Tabling",
        "description": "Stop by our table to talk with McKinley's Women's Health Unit staff. Learn more about breast cancer prevention, risk factors and early detection. We will share educational resources, self-check guides and other information. Pick up awareness ribbons and other give away items. Also take a moment to honor survivors and those impacted by breast cancer. Together we can spread the knowledge!",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "McKinley Health Center",
        "location": "Anniversary Plaza, Main Quad",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "10:00 AM",
        "end_time": "12:00 PM"
    },
    "https://calendars.illinois.edu//detail/594?eventId=33526110": {
        "title": "Writing Effective Personal Statements for Fellowship Proposals",
        "description": "Many funding agencies require a personal statement in addition to an applicant’s research proposal. Why?! What on earth are you supposed to talk about? If these questions have induced writer’s block, this workshop is for you. We will assess the range of personal statement prompts you may encounter and distill their shared essence. Participants will learn the qualities of a compelling statement and a writing process they can follow to arrive at a complete first draft. Register in advance for the link to join this online workshop.See more Graduate College Workshops.",
        "cost": 0.0,
        "tag": "Professional Development",
        "host": "Graduate College Office of External Fellowships",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "10:00 AM",
        "end_time": "11:30 AM"
    },
    "https://calendars.illinois.edu//detail/594?eventId=33534506": {
        "title": "Bring A Healthy U of I",
        "description": "Weekly interactive tabling events to learn about resources for stress management individually and throughout the campus community. Each week we have education, an activity, and giveaways around a new theme. Please join us for a break in your day!",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "McKinley Health Education & Grainger Library",
        "location": "Grainger Library, 4th floor",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "3:00 PM",
        "end_time": "4:00 PM"
    },
    "https://calendars.illinois.edu//detail/4756?eventId=33525596": {
        "title": "October CDA/NCSA Colloquium: Davide Sosso, The Curious Case of the Silicon Strawberry",
        "description": "Please see this link for more information: https://go.illinois.edu/101325-seminar",
        "cost": 0.0,
        "tag": "Conference/Workshop",
        "host": "CDA and NCSA",
        "location": "NCSA Building, 1205 W. Clark St., Urbana IL 61801 RM 1040",
        "start_date": "Oct 13, 2025",
        "end_date": "Oct 13, 2025",
        "start_time": "1:00 PM",
        "end_time": "1:00 PM"
    },
    "https://calendars.illinois.edu//detail/4756?eventId=33508598": {
        "title": "SWTCIE Illinois Video Shoot with Silfies Media - Human Support Services",
        "description": "The filming will include one selected SWTCIE participant (who has not been filmed before), the assigned employment specialist (ES), and if the participant is working, the employer who has hired them. Each will participate in a sit-down interview with a member of the media team. The interviews of the ES & participants will be on site at the place of employment, if possible.",
        "cost": 0.0,
        "tag": "Other",
        "host": "Selfies Media",
        "location": "988 IL-3, Waterloo, IL 62298",
        "start_date": "Oct 21, 2025",
        "end_date": "Oct 21, 2025",
        "start_time": "12:00 PM",
        "end_time": "5:00 PM"
    },
    "https://calendars.illinois.edu//detail/4756?eventId=33525597": {
        "title": "October NCSA Colloquium: Will Lai, Poisoning of Networks with Adversarial Particle\n                              Swarm Optimization",
        "description": "The National Center for Supercomputing Applications (NCSA) is hosting its monthly colloquium series and invites everyone to participate in the October session. This month's event will be led by William K. M. Lai, Assistant Research Professor in Molecular Biology, Genetics, and Computational Biology at Cornell. William directs both the Cornell Center for Vertebrate Genomics and the Cornell EpiGenomics Core Facility. His research group integrates novel genomic assays and custom bioinformatic algorithms, often leveraging machine learning and explainable AI, to dissect how protein-DNA interactions vary across cell states and contribute to disease.Title: Poisoning of networks with adversarial particle swarm optimizationAbstract:We present Adversarial Particle Swarm Optimization (APSO) as a black-box optimization-based approach for crafting poisoned data. Poisoned data is a significant threat to the reliability and security of deep learning systems. Unlike prior poisoning methods, APSO leverages swarm intelligence to efficiently search for perturbations that reduce target model performance without any a priori knowledge of training data or access to the model weights and biases. We evaluate APSO on models trained to classify MNIST, CIFAR-10, and AudioMNIST using a variety of architectures and adversarial hardening techniques and demonstrate APSO’s ability to quantify model resilience to adversarial attack. We also investigate the feasibility of black-box transfer attacks wherein attacks performed on one model transfer their poisoning to another. The results highlight a critical concern: the transferability of poisoned data, which poses a potential risk for real-world AI systems, where poisoned data can propagate undetected across diverse models and architectures. These findings underscore the need for enhanced defense mechanisms to safeguard against adversarial threats in multi-model environment.",
        "cost": 0.0,
        "tag": "Conference/Workshop",
        "host": "National Center for Supercomputing Applications",
        "location": "NCSA Building, 1205 W. Clark St., Urbana IL 61801 Room 1040",
        "start_date": "Oct 29, 2025",
        "end_date": "Oct 29, 2025",
        "start_time": "2:00 PM",
        "end_time": "2:00 PM"
    },
    "https://calendars.illinois.edu//detail/4756?eventId=33525598": {
        "title": "December NCSA Colloquium: Suresh Marru",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Conference/Workshop",
        "host": "National Center for Supercomputing Applications",
        "location": "NCSA Building, 1205 W. Clark St., Urbana IL 61801 Room 1040",
        "start_date": "Dec 3, 2025",
        "end_date": "Dec 3, 2025",
        "start_time": "2:00 PM",
        "end_time": "2:00 PM"
    },
    "https://calendars.illinois.edu//detail/4756?eventId=33521119": {
        "title": "Winter 2026 SWTCIE Illinois Employment Specialist Roundtable",
        "description": "Quarterly in-person training and collaboration session with agency employment specialists and members of the SWTCIE Illinois staff. (Full day on the 15th, half day on the 16th)There is no cost to attend, but registration is required by TBA. Please allow two weeks notice for accommodation requests.  ",
        "cost": 0.0,
        "tag": "Meeting",
        "host": "SWTCIE Illinois",
        "location": "I Hotel and Illinois Conference Center, 1900 South First Street, Champaign, IL 61820",
        "start_date": "Jan 15, 2026",
        "end_date": "Jan 16, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/596?eventId=33533914": {
        "title": "Imagination, Faith, and Desire: Art and Agency in European Prints, 1475–1800",
        "description": "With over 100 prints on display—including works by Rembrandt, Goya, and Dürer—Imagination, Faith, and Desire is extraordinary for the significance of the works and the exceptionally high quality of the impressions, the excellence of which rivals the holdings at many major museums. On view September 25, 2025, through February 28, 2026. Curated by Maureen Warren, Curator of European and American Art, with contributions from Yajie Hui, Nancy Karrels, and Sandra Racek. In conjunction with the exhibition, Krannert Art Museum is hosting a daylong symposium: Envisioning Gender and Sexuality in Premodern European Prints (Oct 17). Open Tueday–Friday (10–5), Saturday (10–4), and Thursdays until 8 pm, when school is in session. The museum is free and open to everyone. Parking nearby is free after 5 pm and on weekends. This exhibition is supported by the Ursula and R. Stanley Johnson Charitable Fund; the Sandra L. Batzli Memorial Fund; DutchCultureUSA, a program of the Kingdom of the Netherlands in the United States; and in part by Villa Albertine—The French Institute for Culture and Education/Cultural Services of the French Embassy.Krannert Art Museum acknowledges support from the Illinois Arts Council.           ",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "Krannert Art Museum",
        "location": "Krannert Art Museum, 500 E. Peabody Dr., Champaign",
        "start_date": "Sep 25, 2025",
        "end_date": "Feb 28, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/596?eventId=33534224": {
        "title": "Read and Resist Events",
        "description": "Intellectual freedom is more than banned books. It's the free flow of ideas and information. Protect freedom to read, create, and express. Borrow a banned book from the Library bookmobile, create resistance art, or visit the cultural center libraries for a chance to win a limited edition Read & Resist tote bag and gift card to the Illini Union bookstore.",
        "cost": 0.0,
        "tag": "Conference/Workshop",
        "host": "Asian American Cultural Center, Bruce D. Nesbitt African American Cultural Center,\n                                 Gender & Sexuality Resource Center, International Education, La Casa Cultural Latina,\n                                 Native American House, Salaam MENA Center, Skeuomorph Press, University Library, Women's\n                                 Resources Center",
        "location": "Locations Vary (see flyer)",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 13, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/596?eventId=33530102": {
        "title": "Film screening: \"From Ground Zero\", Part of the \"Palestine in the World\" Series",
        "description": "From Ground Zero is a collection of 22 short films made in Gaza. Initiated by Palestinian director Rashid Masharawi, the project was born to give a voice to 22 Gazan filmmakers to tell the untold stories of the current war on film. ",
        "cost": 0.0,
        "tag": "Film Screening",
        "host": "Center for South Asian and Middle Eastern Studies & the Arabic Language Program",
        "location": "1080 Lucy Ellis  Conference Center Room , 707 S. Mathews Ave.  Urbana, IL 61801",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "4:00 PM"
    },
    "https://calendars.illinois.edu//detail/596?eventId=33533815": {
        "title": "Japanese Tea Ceremony",
        "description": "Chado, or the Way of Tea, is one of the most ancient and revered arts of Japan and is at the very heart of Japan House. It is a ceremonial way of preparing and serving matcha (powdered green tea) that benefits both the host and the guest through mutual respect, non-verbal communication, and a calmness, or sense of peace, away from everyday life.There are many different variations of this revered 500-year-old art form. Traditionally, guests sit in the seiza posture on the tatami mats (kneeling with legs folded underneath and resting on the heels). There is also a variety of tea ceremony in which one sits on a chair while drinking the tea called ryūrei style, or table-style tea ceremony.Historically in Japan, people didn't use chairs. They sat on elevated tatami flooring for most everything, even to eat meals. The ryūrei style of tea ceremony was created by Gengensai Seichū (1810-1877), the 11th head of the Urasenke School of Tea, for an exposition held in 1872 in Kyoto. Many foreigners visited Japan for the first time during this expo, so the government requested that an effort be made to modify the traditional form of tea ceremony as a way of making it more accessible.The main feature of ryūrei style is that both host and guests sit on a chair. The seiza posture is no longer used, but utensils are used in the same way as in a normal tea ceremony. Although this one aspect of the ceremony is altered, the ryūrei style is otherwise the same as a tea ceremony seated on tatami using the seiza posture. Even Japanese people, who use the seiza posture much less than in the past, embrace the ryūrei style of tea ceremony because it places less of a burden on the legs and is more physically accessible.We will be alternating weekly between ryūrei (sitting on chairs) and on tatami mats (sitting cross-legged on the tearoom floor).Seated on tatami mats, sitting cross-legged or kneelingOctober 15October 29November 8 (Saturday)Ryūrei style - seated on chairsSeptember 24October 1November 5November 19__________What To ExpectAfter a brief tour that includes history of Japan House on the campus of the University of Illinois and information on the tea ceremony, watch as the host carefully and thoughtfully prepares each piece of equipment, chosen specifically for that day and season. Each guest will be served wagashi, a traditional seasonal Japanese sweet, and matcha tea in a unique handmade chawan, or tea bowl. Experience a moment of tranquility while learning about proper guest etiquette and the hundreds of years of tradition carried through tea ceremony. Each week, the wagashi will change according to what seasonal ingredients are available.Afterward, there will be time for guests to ask questions, as well as to shop for select items to support our paid internship program. Cash and credit cards are accepted.Tea ceremonies will feature a variety of special handmade sweets, or wagashi, using recipes from the cookbooks \"Wagashi: Season by Season\" and \"The Art of Wagashi: Recipes for Japanese Sweets that Delight the Palate and the Eyes\" written by Japan House Professor Emeritus Kimiko Gunji. The cookbook will be available for purchase.Reservations are required, no walk-ins or observers will be allowed due to limited space inside and the intimate nature of the tea ceremony. Space is limited.Regarding attire: all guests will be asked to remove shoes upon entering, and to wear clean, white socks (we have some to lend you if you forget). We ask that attendees dress modestly and legs be covered as is traditional in Japan. Bags and electronic devices can be securely stored in our front cubbies.Please do not be late - once the tea ceremony begins, entry will not be permitted as it is disruptive to the experience.Regarding parking and getting to the entrance: due to construction of the Ogura-Sato Annex adjacent to the building, we suggest parking at F-31 (north lot) and walking 5-7 minutes to get to the north entrance. The south entrance is inaccessible due to construction fencing. For guests who opt to park at F-32 (south lot), please note that you will have to walk over a small hill to get to the sidewalk that leads to the north entrance. We will update the map below accordingly. Thank you for your understanding.FAQsWhy is tea ceremony sometimes served Ryūrei (table style) and not the traditional style on the tatami mats?In order to accommodate guests of all ages and ranges of mobility, we offer a style of tea ceremony where all guests sit on chairs. Tea ceremonies where guests sit on tatami are held on alternating Wednesdays. For any questions about accessibility or food allergies, please email japanhouse@illinois.eduWhat are my transport/parking options getting to the event?Japan House is located in the Arboretum at the University of Illinois at 2000 S. Lincoln Avenue between Kirby/Florida and Windsor Road. Parking is available in the lot to the north of Japan House (F-31 at St. Mary's Road and Lincoln) and to the south of Japan House (F-32 on Lincoln across from the Vet Med complex). Spaces are marked with a placard and must be paid with Mobile Meter or Park Mobile (https://parkmobile.io/ ) phone apps, or by calling 217-207-3033. After 5pm and weekends all parking spaces are free!There are bike racks near both parking lots. The MTD Raven comes near Japan House on Lincoln Ave.The front door is located on the north side of the building. Please allow plenty of time to park and get to the front door so we may start on time.Is my registration/ticket transferrable?Yes, if space allows, you may transfer your registration to a different event. Transfers must be requested at least 24 hours before the date of your initial reservation. EventBrite is the official ticket vendor for Japan House events - we do not use any other platform. Please do not purchase tickets from third-party sites or individuals.Do I have to bring my printed ticket to the event?You do not have to bring your ticket. We will just need your name to check in.The name on the registration/ticket doesn't match the attendee. Is that okay?The purchaser of the ticket can go to \"My Tickets\" and change the name to whomever will be attending.What if I want to purchase more than 10 tickets or schedule a special group?We are happy to work with you to schedule a group. Please email us at japanhouse@illinois.edu with your inquiry. We can also talk about scheduling a tea ceremony at a private time for your group, depending on availability.What is the refund policy?Your registration is refundable if you contact us at japanhouse@illinois.edu at least 24 hours before the date of your reservation. Please note that EventBrite fees are non-refundable.Are there ID requirements or an age limit to enter the event?Children are welcome as long as they are able to sit quietly throughout the ceremony. All minors must be accompanied by a responsible adult guardian at all times. A ticket is required for all party members regardless of whether they partake in the tea and sweet.Where can I contact the organizer with any questions?Contact us with any questions at japanhouse@illinois.eduWhat is Tomonokai? How can I support Japan House?Tomonokai are \"Friends of Japan House\". The Tomonokai program was established in 1998 with a goal of supporting Japan House programming and events and promoting an understanding of Japanese Arts and Culture. This tax deductible membership entitles you to special member benefits including discounts on events and merchandise, and vouchers for private tea ceremonies.Japan House is non-profit and fully relies upon the generosity and kindness of supporters to continue to provide our campus and community vibrant programming that is immersive, engaging, and most importantly, that celebrates diversity! Consider becoming Tomonokai, or Friend of Japan House, or support by clicking here.",
        "cost": "$16.00 for students/Tomonokai; $20.00 for general public",
        "tag": "Ceremony/Service",
        "host": "Japan House",
        "location": "2000 S Lincoln Ave Urbana, IL 61802",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "5:15 PM",
        "end_time": "6:15 PM"
    },
    "https://calendars.illinois.edu//detail/596?eventId=33524510": {
        "title": "iCU Intercultural Dinner Dialogue Series - Discovering Bangladesh",
        "description": "Bangladesh, a global hub for the textile industry, is also known for its rivers and iconic landmarks like Cox’s Bazar, the world’s longest sea beach, and the Sundarbans, home to the royal Bengal tiger. Come and explore the rich culture of Bangladesh through fun activities and displays and learn how the language, cuisine, clothing, and customs shape the everyday lives of the Bangladeshi people with the Bangladeshi Students’ Association. Enjoy cultural displays, traditional snacks, and student-led storytelling that highlight the country’s deep-rooted hospitality, resilience, and revolutionary spirit. Dinner is provided.This program is open to all current students, regardless of race, color or national origin. Reasonable accommodations are available upon request, please contact internationaled@illinois.edu.",
        "cost": 0.0,
        "tag": "Religious/Cultural",
        "host": "International Education, Bangladeshi Students’ Association and Asian American Cultural\n                                 Center",
        "location": "1210 W Nevada Street, Urbana (Asian American Cultural Center/International Education)",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "5:30 PM",
        "end_time": "7:00 PM"
    },
    "https://calendars.illinois.edu//detail/62?eventId=33533153": {
        "title": "Zines as Tools for Community Exhibit",
        "description": "Explore a curated selection of zines from personal and public collections in town.(Open during store hours)",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "CU Small Press Fest",
        "location": "Art Coop Gallery, 150 Lincoln Square Village, Urbana",
        "start_date": "Sep 14, 2025",
        "end_date": "Oct 11, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/62?eventId=33533914": {
        "title": "Imagination, Faith, and Desire: Art and Agency in European Prints, 1475–1800",
        "description": "With over 100 prints on display—including works by Rembrandt, Goya, and Dürer—Imagination, Faith, and Desire is extraordinary for the significance of the works and the exceptionally high quality of the impressions, the excellence of which rivals the holdings at many major museums. On view September 25, 2025, through February 28, 2026. Curated by Maureen Warren, Curator of European and American Art, with contributions from Yajie Hui, Nancy Karrels, and Sandra Racek. In conjunction with the exhibition, Krannert Art Museum is hosting a daylong symposium: Envisioning Gender and Sexuality in Premodern European Prints (Oct 17). Open Tueday–Friday (10–5), Saturday (10–4), and Thursdays until 8 pm, when school is in session. The museum is free and open to everyone. Parking nearby is free after 5 pm and on weekends. This exhibition is supported by the Ursula and R. Stanley Johnson Charitable Fund; the Sandra L. Batzli Memorial Fund; DutchCultureUSA, a program of the Kingdom of the Netherlands in the United States; and in part by Villa Albertine—The French Institute for Culture and Education/Cultural Services of the French Embassy.Krannert Art Museum acknowledges support from the Illinois Arts Council.           ",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "Krannert Art Museum",
        "location": "Krannert Art Museum, 500 E. Peabody Dr., Champaign",
        "start_date": "Sep 25, 2025",
        "end_date": "Feb 28, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/62?eventId=33536005": {
        "title": "BLXCK Uncanny: Tales of the Black + the Weird",
        "description": "What can be weirder that the idea of race? A concept that hasn’t existed in the world for even a millennium and yet has been part of a foundational system of capitalism, and many other global advancements for centuries. “BLXCK Uncanny: Tales of the Black + the Weird” is an exhibition in response to the times we are in. The X marking the unknown. As we are accelerating toward technologically advanced futures, we are regressing toward pasts that are not so distant as many of us would like to pretend and unfortunately many of us would like to speed toward.  Featuring the work of Oriana Crutcher, Elias Finkelman, Patrick Earl Hammie, and Black KirbyOpening Reception, Oct 16, 5-7pmUniversity YMCA 1001 S Wright St.Friday Forum panel discussion with artists, Oct 31. 12-1pm",
        "cost": 0.0,
        "tag": "Ceremony/Service",
        "host": "School of Art & Design",
        "location": "University YMCA 1001 S Wright St.",
        "start_date": "Oct 8, 2025",
        "end_date": "Nov 9, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/62?eventId=33529907": {
        "title": "Art History Colloquium: Cassandra Smith",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Lecture",
        "host": "School of Art & Design",
        "location": "316 A&D",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "5:30 PM",
        "end_time": "5:30 PM"
    },
    "https://calendars.illinois.edu//detail/637?eventId=33525631": {
        "title": "Get Fresh! Seasonal Food Program",
        "description": "Get Fresh is a seasonal foods program that aims to increase the availability, accessibility, and consumption of fresh produce on campus. Participants will pick up their re-usable Get Fresh! tote of seasonal fruit and vegetables every Wednesday. Pick up your bag between 3-5pm at the ARC Instructional Kitchen. Participants Receive: • Get Fresh! reusable grocery tote • A sample of a variety of seasonal produce each week • Recipes each week for ideas on how to use your produce  • 1-2 types of bread and/or sweets from Tooth Butter Bakery • Educational resources prepared by McKinley's Health Education Unit and nutrition peers • Produce sample sources by The Student Sustainable Farm. Registration closes 3 days prior to each session. ",
        "cost": "$75-90",
        "tag": "Health/Fitness",
        "host": "Campus Recreation, McKinley Health Education, Sustainable Student Farm, Tooth Butter\n                                 Bakery",
        "location": "ARC Instructional Kitchen",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/637?eventId=33521398": {
        "title": "Public Skate",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "Campus Recreation",
        "location": "ice arena",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "7:30 PM",
        "end_time": "9:30 PM"
    },
    "https://calendars.illinois.edu//detail/637?eventId=33532698": {
        "title": "Flu Shots: College of Law",
        "description": "Never Miss A Memory! Get your free flu shot today. Bring your University of Illinois ID card and please wear attire that provides access to your upper arm.",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "McKinley Health Center",
        "location": "Law Bldg: Mock Court Room",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "9:30 AM",
        "end_time": "1:30 PM"
    },
    "https://calendars.illinois.edu//detail/637?eventId=33532625": {
        "title": "Breast Cancer Awareness Tabling",
        "description": "Stop by our table to talk with McKinley's Women's Health Unit staff. Learn more about breast cancer prevention, risk factors and early detection. We will share educational resources, self-check guides and other information. Pick up awareness ribbons and other give away items. Also take a moment to honor survivors and those impacted by breast cancer. Together we can spread the knowledge!",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "McKinley Health Center",
        "location": "Anniversary Plaza, Main Quad",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "10:00 AM",
        "end_time": "12:00 PM"
    },
    "https://calendars.illinois.edu//detail/637?eventId=33521833": {
        "title": "Lunch Skate",
        "description": "N/A",
        "cost": 0.0,
        "tag": "Health/Fitness",
        "host": "Campus Recreation",
        "location": "ice arena",
        "start_date": "Oct 9, 2025",
        "end_date": "Oct 9, 2025",
        "start_time": "11:15 AM",
        "end_time": "12:45 PM"
    },
    "https://calendars.illinois.edu//detail/4757?eventId=33526608": {
        "title": "Sweetbitter: The Literary Legacies and Afterlives of Sappho",
        "description": "The ancient poet Sappho coined “sweetbitter” in one of her most evocative verses, still striking us to the heart nearly three millennia later. But who was Sappho? As with so many ancient figures, she is more legend than person today, her story told and retold even as her poetry continues to enchant and move us. Ranging from ancient Greece to seventeenth century France to twentieth century Britain, this exhibit will explore Sappho as poet, muse, and icon.The exhibit, Sweetbitter: The Literary Legacies and Afterlives of Sappho, will be on display in the RBML through May 2025.",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "The Rare Book & Manuscript Library",
        "location": "Main Library Room 346",
        "start_date": "Sep 19, 2025",
        "end_date": "Aug 10, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/4757?eventId=33533914": {
        "title": "Imagination, Faith, and Desire: Art and Agency in European Prints, 1475–1800",
        "description": "With over 100 prints on display—including works by Rembrandt, Goya, and Dürer—Imagination, Faith, and Desire is extraordinary for the significance of the works and the exceptionally high quality of the impressions, the excellence of which rivals the holdings at many major museums. On view September 25, 2025, through February 28, 2026. Curated by Maureen Warren, Curator of European and American Art, with contributions from Yajie Hui, Nancy Karrels, and Sandra Racek. In conjunction with the exhibition, Krannert Art Museum is hosting a daylong symposium: Envisioning Gender and Sexuality in Premodern European Prints (Oct 17). Open Tueday–Friday (10–5), Saturday (10–4), and Thursdays until 8 pm, when school is in session. The museum is free and open to everyone. Parking nearby is free after 5 pm and on weekends. This exhibition is supported by the Ursula and R. Stanley Johnson Charitable Fund; the Sandra L. Batzli Memorial Fund; DutchCultureUSA, a program of the Kingdom of the Netherlands in the United States; and in part by Villa Albertine—The French Institute for Culture and Education/Cultural Services of the French Embassy.Krannert Art Museum acknowledges support from the Illinois Arts Council.           ",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "Krannert Art Museum",
        "location": "Krannert Art Museum, 500 E. Peabody Dr., Champaign",
        "start_date": "Sep 25, 2025",
        "end_date": "Feb 28, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/4757?eventId=33512915": {
        "title": "Research Portfolio Development 6 – Complexities of Working in Multidisciplinary Proposals",
        "description": "More and more funding agencies are focusing on tightly coupled multidisciplinary research that breaks down the typical silos between disciplines and even within research groups. These tightly coupled teams can tackle grand challenges that are far more impactful than the participants could accomplish on their own. But with these new many-domain research contexts come challenges in terms, metrics, significance, worldview, and many other assumptions we all use on any given day. This workshop will use the emerging concept of convergence research to explore what multidisciplinary research means, what sponsor agencies are looking for, and how to structure appropriate scopes of work and outcomes to lead to a believable and compelling proposal.[For researchers moving into larger multidisciplinary contexts, but useful to all]",
        "cost": 0.0,
        "tag": "Professional Development",
        "host": "Prairie Research Institute",
        "location": "NRB 101, 615 E. Peabody Dr., Champaign, IL 61820",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "3:00 PM",
        "end_time": "4:30 PM"
    },
    "https://calendars.illinois.edu//detail/4757?eventId=33520138": {
        "title": "Climate Change and the Urgency of Hope, Action, and Joy",
        "description": "With climate change and resulting weather extremes already in motion, we are experiencing disaster and devastation, from our own backyards to communities across the globe. And yet, amidst the temptation and immobilization of despair, anger, or grief, can we find moments of pause and hope? Can we find climate action that matters and instills sparks of joy? In this talk, Dr. Lisa Reyes Mason invites us to consider and lean into these questions together, grounded in a belief that our collective work on climate change can indeed lead to a healthier and thriving world for all. After highlighting examples of climate injustice in the U.S. and abroad, Dr. Mason will provide ways to “connect the dots” and multi-solve the climate crisis with other societal problems, discuss strategies for action including collaborating across sectors and silos, and offer touchstones of hope and joy inspired by Christiana Figueres’ approach to holding both “outrage and optimism” and Eve Tuck’s “desire-based” framework for community partnership and social change.",
        "cost": 0.0,
        "tag": "Lecture",
        "host": "Center for Advanced Study",
        "location": "Ballroom, Alice Campbell Alumni Center, 601 S. Lincoln Ave, Urbana",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "4:00 PM"
    },
    "https://calendars.illinois.edu//detail/4757?eventId=33532284": {
        "title": "Intro to Proposal Writing & Funding Your Research (In-Person)",
        "description": "During this workshop, we will discuss the fundamentals of proposal writing, guiding undergraduate students to formulate successful research projects and explain their research in a concise and compelling manner that is understandable to a general audience. Students will leave the workshop with (1) basic knowledge about research proposals and their structure, (2) tactics and tools to write successful research statements, and (3) a list of resources for assistance in the writing process. This workshop is a collaboration between the Office of Undergraduate Research and the Writers Workshop and will be most well-suited for undergraduates who are drafting proposals for the first time, hoping to improve their proposal writing skills, and/or applying for an OUR Research Support Grant.This event will be held in the Illini Union Bookstore Building, Room 514. It is open to current University of Illinois affiliates (students, faculty, and staff). Please register using your Illinois email address by October 7, and Writers Workshop will send a reminder on the morning of the event. Space is limited to 20 seats; if this session is full, consider attending on October 14.",
        "cost": 0.0,
        "tag": "Conference/Workshop",
        "host": "Writers Workshop and Office of Undergraduate Research",
        "location": "Illini Union Bookstore Building, Rm 514",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "5:00 PM"
    },
    "https://calendars.illinois.edu//detail/598?eventId=33526608": {
        "title": "Sweetbitter: The Literary Legacies and Afterlives of Sappho",
        "description": "The ancient poet Sappho coined “sweetbitter” in one of her most evocative verses, still striking us to the heart nearly three millennia later. But who was Sappho? As with so many ancient figures, she is more legend than person today, her story told and retold even as her poetry continues to enchant and move us. Ranging from ancient Greece to seventeenth century France to twentieth century Britain, this exhibit will explore Sappho as poet, muse, and icon.The exhibit, Sweetbitter: The Literary Legacies and Afterlives of Sappho, will be on display in the RBML through May 2025.",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "The Rare Book & Manuscript Library",
        "location": "Main Library Room 346",
        "start_date": "Sep 19, 2025",
        "end_date": "Aug 10, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/598?eventId=33533914": {
        "title": "Imagination, Faith, and Desire: Art and Agency in European Prints, 1475–1800",
        "description": "With over 100 prints on display—including works by Rembrandt, Goya, and Dürer—Imagination, Faith, and Desire is extraordinary for the significance of the works and the exceptionally high quality of the impressions, the excellence of which rivals the holdings at many major museums. On view September 25, 2025, through February 28, 2026. Curated by Maureen Warren, Curator of European and American Art, with contributions from Yajie Hui, Nancy Karrels, and Sandra Racek. In conjunction with the exhibition, Krannert Art Museum is hosting a daylong symposium: Envisioning Gender and Sexuality in Premodern European Prints (Oct 17). Open Tueday–Friday (10–5), Saturday (10–4), and Thursdays until 8 pm, when school is in session. The museum is free and open to everyone. Parking nearby is free after 5 pm and on weekends. This exhibition is supported by the Ursula and R. Stanley Johnson Charitable Fund; the Sandra L. Batzli Memorial Fund; DutchCultureUSA, a program of the Kingdom of the Netherlands in the United States; and in part by Villa Albertine—The French Institute for Culture and Education/Cultural Services of the French Embassy.Krannert Art Museum acknowledges support from the Illinois Arts Council.           ",
        "cost": 0.0,
        "tag": "Exhibition",
        "host": "Krannert Art Museum",
        "location": "Krannert Art Museum, 500 E. Peabody Dr., Champaign",
        "start_date": "Sep 25, 2025",
        "end_date": "Feb 28, 2026",
        "start_time": "12:00 AM",
        "end_time": "11:59 PM"
    },
    "https://calendars.illinois.edu//detail/598?eventId=33520138": {
        "title": "Climate Change and the Urgency of Hope, Action, and Joy",
        "description": "With climate change and resulting weather extremes already in motion, we are experiencing disaster and devastation, from our own backyards to communities across the globe. And yet, amidst the temptation and immobilization of despair, anger, or grief, can we find moments of pause and hope? Can we find climate action that matters and instills sparks of joy? In this talk, Dr. Lisa Reyes Mason invites us to consider and lean into these questions together, grounded in a belief that our collective work on climate change can indeed lead to a healthier and thriving world for all. After highlighting examples of climate injustice in the U.S. and abroad, Dr. Mason will provide ways to “connect the dots” and multi-solve the climate crisis with other societal problems, discuss strategies for action including collaborating across sectors and silos, and offer touchstones of hope and joy inspired by Christiana Figueres’ approach to holding both “outrage and optimism” and Eve Tuck’s “desire-based” framework for community partnership and social change.",
        "cost": 0.0,
        "tag": "Lecture",
        "host": "Center for Advanced Study",
        "location": "Ballroom, Alice Campbell Alumni Center, 601 S. Lincoln Ave, Urbana",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "4:00 PM"
    },
    "https://calendars.illinois.edu//detail/598?eventId=33529920": {
        "title": "MillerComm Lecture Series 2026: Climate Change and the Urgency of Hope, Action and\n                              Joy by Dr. Lisa Reyes Mason",
        "description": "Climate Change and the Urgency of Hope, Action, and Joy by Lisa Reyes Mason. In this talk, Dr. Reyes Mason will highlight examples of climate injustice in the US and abroad, then provide ways to \"connect the dots\" and multi-solve the climate crisis with other societal problems, discuss strategies for action including collaborating across sectors and silos, and offer touchstones of hope and joy inspired by Christiana Figueres' approach to holding both \"outrage and optimism\" and Eve Tuck's \"desire based\" framework for community partnership and social change. ",
        "cost": 0.0,
        "tag": "Lecture",
        "host": "Hosted by the Center for the Study of Global Gender Equity, in conjunction with Center\n                                 for Global Studies, College of Law, Department of Civil & Environmental Engineering,\n                                 Department of Natural Resources, & Environmental Science, Institute for Sustainability,\n                                 Energy & Environment, School of Social Work. Series support provided by: Center for\n                                 Advanced Study, George A. Miller Endowment, James Marchand Memorial Fund, Ledyard\n                                 R. Tucker Fund, Peggy Harris Memorial Fund.",
        "location": "Ballroom, Alice Campbell Alumni Center, 601 S Lincoln Ave, Urbana, IL 61801",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "4:00 PM"
    },
    "https://calendars.illinois.edu//detail/598?eventId=33527270": {
        "title": "The Physics Colloquium Eric Kuo (University of Illinois Urbana Champaign) “Developing\n                              the Skills and Mindsets for Future Success Through Physics Education”",
        "description": "Abstract:  For physics students who do not end up working in physics (i.e. most students), how can physics education contribute to their future academic and professional success? Although Physics Education Research (PER) has been widely successful at enhancing student understanding of physics concepts, the field has been turning towards fostering the skills and mindsets that can prepare students for future learning and adversity.  In this talk, I will share examples from two areas of my research.  The first illustrates the teaching and assessment of the mathematical sensemaking skills that physicists commonly use to connect mathematical and physical thinking.   The second shows how engagement and success can be fostered by helping students view learning physics as a challenge to be met rather than a threat to be avoided.  Although physics instruction often focuses on learning physics content and problem-solving skills, I propose that mathematical sensemaking and a challenge mindset are ways of thinking and engaging that can propel students to future success. Though the rise of generative AI has sparked recent existential debates for physics education, such skills and mindsets illustrate the types of learning outcomes not easily replaced by AI.",
        "cost": 0.0,
        "tag": "Seminar/Symposium",
        "host": "Department of Physics",
        "location": "Loomis Lab 141",
        "start_date": "Oct 8, 2025",
        "end_date": "Oct 8, 2025",
        "start_time": "4:00 PM",
        "end_time": "5:00 PM"
    }
}